cases/ansys_verification/VMFL019/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  VMFL019 -- icoFoam PISO.  p pinned by pRefCell/pRefValue 0 (pure-shear flow
  has uniform pressure; cyclic-x + walls leave it defined only up to a constant).
  Tight tolerances so linear-solve error is far below the discretisation error
  the triple measures.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
    pFinal
    {
        $p;
        relTol          0;
    }
    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-11;
        relTol          0;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
